In [ ]:
%%sql
CREATE TABLE Customers (
  `CustomerID` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `Name` TEXT,
  `Gender` TEXT,
  `Address` VARCHAR(255),
  `Birthdate` INTEGER,
  `Phone` INTEGER
);

In [ ]:
%%sql
USE project;

In [ ]:
%%sql
CREATE DATABASE project;

In [19]:
%%sql
CREATE TABLE OrderInfo (
  `OrderNumber` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `CustomerID` INTEGER,
  `Date` Date,
  `Time` Time,
  `Price` DOUBLE,
  FOREIGN KEY (`CustomerID`) REFERENCES Customers (`CustomerID`) 
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

In [20]:
%%sql
CREATE TABLE MenuItemsOrder (
  `OrderNumber` INTEGER,
  `MenuItemsID` INTEGER,
  FOREIGN KEY (`OrderNumber`) REFERENCES OrderInfo (`OrderNumber`),
  FOREIGN KEY (`MenuItemsID`) REFERENCES MenuItems (`MenuItemsID`)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

In [ ]:
%%sql
CREATE TABLE MenuItems (
  `MenuItemsID` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `Name` TEXT,
  `Price` DOUBLE 
);

In [32]:
%%sql
CREATE TABLE PizzaOrder (
  `OrderNumber` INTEGER,
  `PizzaID` INTEGER,
  FOREIGN KEY (`OrderNumber`) REFERENCES OrderInfo (`OrderNumber`),
  FOREIGN KEY (`PizzaID`) REFERENCES Pizza (`PizzaID`)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

In [28]:
%%sql
CREATE TABLE Pizza (
  `PizzaID` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `Name` TEXT,
  `DietaryInfo` TEXT,
  `Price` DOUBLE
);

In [7]:
%%sql
CREATE TABLE LoginInformation (
  `CustomerID` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `Username` VARCHAR(255),
  `Password` VARCHAR(255),
  FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

In [ ]:
%%sql
CREATE TABLE DeliveryPerson (
  `DeliveryID` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `AssignedArea` VARCHAR(9),
  `Availability` TEXT
);

In [23]:
%%sql
CREATE TABLE Delivery (
  `OrderNumber` INTEGER,
  `DeliveryID` INTEGER,
   `Status` TEXT,
  `DeliveryTime` Time,
  FOREIGN KEY (`DeliveryID`) REFERENCES DeliveryPerson (`DeliveryID`),
  FOREIGN KEY (OrderNumber) REFERENCES OrderInfo (`OrderNumber`)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

In [ ]:
%%sql

CREATE TABLE Ingredients (
  `IngredientID` INTEGER PRIMARY KEY AUTO_INCREMENT,
  `Name` TEXT,
  `Price` DOUBLE
);

In [10]:
%%sql
CREATE TABLE PizzaIngredients (
  `PizzaID` INTEGER,
  `IngredientID` INTEGER,
  `DietaryInfo` TEXT,
  `Price` DOUBLE,
  FOREIGN KEY (`PizzaID`) REFERENCES `Pizza`(`PizzaID`),
  FOREIGN KEY (`IngredientID`) REFERENCES `Ingredients`(`IngredientID`)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

In [36]:
%%sql
INSERT INTO Ingredients (Name, Price) VALUES 
   ('Tomato sauce', 2.50),
   ('Mozzarella', 4.20), 
   ('Pepperoni', 3.50), 
   ('Mushrooms',2.20), 
   ('Olives',2.40), 
   ('Basil',1.60),
   ('Onions',1.20),
   ('Bell Peppers',4.50),
   ('Sausage', 5.20),   
   ('Pineapple', 6.50);

In [21]:
import sqlalchemy
print(sqlalchemy.__version__)

1.4.39

In [35]:
%%sql
ALTER TABLE Customers MODIFY COLUMN Birthdate DATE;

In [ ]:
%%sql
SELECT * FROM Customers;

In [1]:
%%sql
INSERT INTO Pizza(Name, DietaryInfo) VALUES ('Margherita', 'Vegetarian'), 
                                                   ('Pepperoni', 'Meat'), 
                                                   ('Hawaiian', 'Meat'), 
                                                   ('Vegetarian Delight', 'Vegetarian'),
                                                   ('Meat Lover', 'Meat'), 
                                                   ('Four Seasons', 'Vegan'),
                                                   ('BBQ Chicken Pizza', 'Meat'),
                                                   ('Capricciosa', 'Meat'),
                                                   ('Mexican Pizza', 'Meat'),
                                                   ('Supreme Pizza', 'Meat');

In [23]:
%%sql
INSERT INTO PizzaIngredients (PizzaID, IngredientID, DietaryInfo, Price) VALUES 
(1, 1, 'Vegetarian', 2.50), 
(1, 2, 'Vegetarian', 4.20), 
(1, 6, 'Vegetarian', 1.60), 
(2, 1, 'Meat', 2.50), 
(2, 2, 'Meat', 4.20), 
(2, 3, 'Meat', 3.50), 
(3, 1, 'Meat', 2.50), 
(3, 2, 'Meat', 4.20), 
(3, 9, 'Meat', 5.20), 
(4, 1, 'Vegetarian', 2.50), 
(4, 2, 'Vegetarian', 4.20), 
(4, 4, 'Vegetarian', 2.20), 
(4, 7, 'Vegetarian', 1.20), 
(4, 8, 'Vegetarian', 4.50), 
(5, 1, 'Meat', 2.50), 
(5, 2, 'Meat', 4.20), 
(5, 3, 'Meat', 3.50), 
(6, 1, 'Vegan', 2.50), 
(6, 2, 'Vegan', 4.20), 
(6, 4, 'Vegan', 2.20), 
(6, 7, 'Vegan', 1.20), 
(6, 5, 'Vegan', 2.40), 
(7, 2, 'Meat', 4.20), 
(7, 7, 'Meat', 1.20), 
(8, 1, 'Meat', 2.50), 
(8, 2, 'Meat', 4.20), 
(8, 4, 'Meat', 2.20), 
(8, 5, 'Meat', 2.40);

In [2]:
%%sql
SELECT * FROM PizzaIngridients;

     PizzaID  IngridientID DietaryInfo  Price
0          1             1  Vegetarian    NaN
1          1             2  Vegetarian    NaN
2          1             6  Vegetarian    NaN
3          2             1        Meat    NaN
4          2             2        Meat    NaN
..       ...           ...         ...    ...
140        7             7        Meat    NaN
141        8             1        Meat    NaN
142        8             2        Meat    NaN
143        8             4        Meat    NaN
144        8             5        Meat    NaN

[145 rows x 4 columns]

In [7]:
%%sql
SELECT * FROM Pizza;

    PizzaID                Name DietaryInfo  Price
0         1          Margherita  Vegetarian    NaN
1         2           Pepperoni        Meat    NaN
2         3            Hawaiian        Meat    NaN
3         4  Vegetarian Delight  Vegetarian    NaN
4         5          Meat Lover        Meat    NaN
..      ...                 ...         ...    ...
85       88        Four Seasons       Vegan    NaN
86       89   BBQ Chicken Pizza        Meat    NaN
87       90         Capricciosa        Meat    NaN
88       91       Mexican Pizza        Meat    NaN
89       92       Supreme Pizza        Meat    NaN

[90 rows x 4 columns]

In [12]:
%%sql
SHOW TABLES;

   Tables_in_project
0          customers
1           delivery
2     deliveryperson
3        ingredients
4   logininformation
5          menuitems
6     menuitemsorder
7          orderinfo
8              pizza
9   pizzaingredients
10        pizzaorder

In [26]:
%%sql
SELECT * FROM Ingredients;

Empty DataFrame
Columns: [OrderNumber, CustomerID, Date, Time, Price]
Index: []

In [6]:
%%sql
DELETE FROM Pizza
WHERE PizzaID = 9;

In [8]:
%%sql
DROP TABLE PizzaIngridients;

In [ ]:
%%sql
DROP TABLE Ingridients;

In [9]:
%%sql
DROP TABLE PizzaOrder;

In [ ]:
%%sql
DROP TABLE Pizza;

In [ ]:
%%sql
ALTER TABLE Pizza DROP COLUMN Price;

In [ ]:
%%sql
ALTER TABLE Pizza ADD COLUMN Price DOUBLE;

In [24]:
%%sql
SELECT * FROM Pizza;

   PizzaID                Name DietaryInfo    Price
0        1          Margherita  Vegetarian  12.6658
1        2           Pepperoni        Meat  15.5652
2        3            Hawaiian        Meat  18.1594
3        4  Vegetarian Delight  Vegetarian  22.2796
4        5          Meat Lover        Meat  15.5652
5        6        Four Seasons       Vegan  19.0750
6        7   BBQ Chicken Pizza        Meat   8.2404
7        8         Capricciosa        Meat  17.2438
8        9       Mexican Pizza        Meat  15.5652
9       10       Supreme Pizza        Meat  14.1918

In [ ]:
%%sql
INSERT INTO PizzaIngredients (PizzaID, IngredientID, DietaryInfo, Price) VALUES 
(10, 2, 'Vegetarian', 4.20), 
(10, 6, 'Vegetarian', 1.60), 
(10, 3, 'Meat', 3.50), 
(9, 2, 'Meat', 4.20), 
(9, 3, 'Meat', 3.50), 
(9, 1, 'Meat', 2.50)

In [ ]:
%%sql
INSERT INTO MenuItems (Name, Price) VALUES ('Coca-Cola Oreo', 2.30),
                                           ('Beer', 5.00),
                                           ('Lemonade', 3.40),
                                           ('Fanta', 2.00),
                                           ('Ice cream', 4.50),
                                           ('Cheesecake', 5.10);

In [31]:
%%sql
SELECT * FROM Customers;

,CustomerID,Name,Gender,Address,Birthdate,Phone
0,1,Denisa Nastasa,Female,Mathijs Heugenstraat 15,2004-09-20,758563220
1,2,Denisa Nastasa,Female,Mathijs Heugenstraat 15,2004-09-20,758563220
2,3,Denisa Nastasa,Female,Mathijs Heugenstraat 15,2004-09-20,758563220
3,4,Denisa Nastasa,Female,"Mathijs Heugenstraat 15, Maastricht",2004-09-20,758563220
4,5,Tom Janssen,Male,"Frankenstraat 112, Maastricht",1993-04-15,612345678
5,6,Emma de Jong,Female,"Sint Pieterstraat 7, Maastricht",1989-02-22,687654321
6,7,Lars van Dijk,Male,"Stationsstraat 12, Maastricht",2000-11-30,610987654
7,8,Sophie Vermeulen,Female,"Céramique 25, Maastricht",1995-07-07,623456789
8,9,Denisa Nastasa,Female,"Mathijs Heugenstraat 15, Maastricht",2004-09-20,758563220
9,10,Luca,Male,Mathijs,2004-07-22,1232343
10,11,Cris,Female,Maastricht,2004-12-14,123
11,12,Emma,Female,acasa,2005-01-09,752905734
12,13,Denisa,Female,acasa,2004-10-04,3982984
13,14,Emma,Femal,aici,2005-10-07,65364
14,15,Ana,Female,aici,2004-10-07,6327
15,16,Maria,Female,S,2004-05-01,3424
16,17,Mihai,Female,S,2004-09-09,123

In [ ]:
%%sql
CREATE TABLE OrderPrice(
    `OrderNumber` INTEGER ,
    `Price` Float,
    FOREIGN KEY (`OrderNumber`) REFERENCES OrderInfo(`OrderNumber`)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);

In [2]:
%%sql
ALTER TABLE OrderInfo DROP COLUMN Price;

In [33]:
%%sql
SELECT * FROM DeliveryPerson;

    DeliveryID AssignedArea Availability
0            1            N  Unavailable
1            2           NE    Available
2            3            E    Available
3            4           SE    Available
4            5            S  Unavailable
5            6           SW    Available
6            7            W    Available
7            8           NW    Available
8            9            C    Available
9           10            N  Unavailable
10          11           NE    Available
11          12            E    Available
12          13           SE    Available
13          14            S    Available
14          15           SW    Available
15          16            W    Available
16          17           NW    Available
17          18            C    Available

In [3]:
%%sql
SELECT * FROM OrderPrice;

   OrderNumber    Price
0           36  55.3690
1           41  18.1594
2           42  20.5652
3           45  31.4356
4           48  20.5652
5           49   0.0000
6           50   0.0000
7           51  16.0787

In [ ]:
%%sql
CREATE TABLE Adress(ID INTEGER PRIMARY KEY AUTO_INCREMENT, Zone VARCHAR(255), Time TIME);

In [ ]:
%%sql
INSERT INTO Adress(Zone, Time) VALUES ('N', '00:25:00'),
                                      ('NE', '00:30:00'),
                                      ('E', '00:35:00'),
                                      ('SE', '00:45:00'),
                                      ('S', '00:40:00'),
                                      ('SW', '00:45:00'),
                                      ('W', '00:35:00'),
                                      ('NW', '00:30:00'),
                                      ('C', '00:30:00');

In [4]:
%%sql
SELECT * FROM Adress;

   ID Zone      Time
0   1    N  00:25:00
1   2   NE  00:30:00
2   3    E  00:35:00
3   4   SE  00:45:00
4   5    S  00:40:00
5   6   SW  00:45:00
6   7    W  00:35:00
7   8   NW  00:30:00
8   9    C  00:30:00

In [5]:
%%sql
CREATE TABLE OrderDeliveryTime(OrderNumber INTEGER,
                                TimeDelivery TIME,
                                FOREIGN KEY (`OrderNumber`) REFERENCES OrderInfo(`OrderNumber`)
                                ON DELETE CASCADE
                                ON UPDATE CASCADE);

In [19]:
%%sql
SELECT * FROM OrderPrice;

    OrderNumber    Price
0            36  55.3690
1            41  18.1594
2            42  20.5652
3            45  31.4356
4            48  20.5652
5            49   0.0000
6            50   0.0000
7            51  16.0787
8            52   4.5000
9            53   4.5000
10           54   4.5000
11           55   0.0000
12           59  29.3087
13           60   0.0000
14           61   0.0000
15           84   0.0000

In [17]:
%%sql
SELECT * FROM OrderInfo;

    OrderNumber  CustomerID        Date      Time
0             1          10  2024-10-04  12:12:30
1             2          12  2024-10-04  12:18:04
2             3          10  2024-10-04  12:30:08
3             4          10  2024-10-04  12:32:14
4             5          10  2024-10-04  12:52:37
..          ...         ...         ...       ...
83           84          15  2024-10-07  14:26:04
84           85          17  2024-10-07  14:27:40
85           86          17  2024-10-07  14:30:10
86           87          17  2024-10-07  14:31:09
87           88          17  2024-10-07  14:34:28

[88 rows x 4 columns]

In [27]:
%%sql
SELECT * FROM Delivery;

Empty DataFrame
Columns: [OrderNumber, DeliveryID, Status, DeliveryTime]
Index: []

In [ ]:
%%sql
INSERT INTO DeliveryPerson(AssignedArea, Availability) VALUES ('N', 'Available'),
                                                                ('NE', 'Available'),
                                                                ('E', 'Available'),
                                                                ('SE', 'Available'),
                                                                ('S', 'Available'),
                                                                ('SW', 'Available'),
                                                                ('W', 'Available'),
                                                                ('NW', 'Available'),
                                                                ('C', 'Available');

In [23]:
%%sql
SHOW TABLES;

    Tables_in_project
0              adress
1           customers
2            delivery
3      deliveryperson
4          ingredient
5         ingredients
6    logininformation
7           menuitems
8      menuitemsorder
9   orderdeliverytime
10          orderinfo
11         orderprice
12              pizza
13   pizzaingredients
14         pizzaorder

In [35]:
%%sql
SELECT * FROM DeliveryPerson;

    DeliveryID AssignedArea Availability
0            1            N  Unavailable
1            2           NE    Available
2            3            E    Available
3            4           SE    Available
4            5            S  Unavailable
5            6           SW    Available
6            7            W    Available
7            8           NW    Available
8            9            C    Available
9           10            N  Unavailable
10          11           NE    Available
11          12            E    Available
12          13           SE    Available
13          14            S  Unavailable
14          15           SW    Available
15          16            W    Available
16          17           NW    Available
17          18            C    Available
18          19            N  Unavailable
19          20           NE    Available
20          21            E    Available
21          22           SE    Available
22          23            S    Available
23          24           SW    Available
24          25            W    Available
25          26           NW    Available
26          27            C    Available